cf/Enums/RoundingMethods.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>RoundingMethods</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Round0_01</Name>
					<Comment>0.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Round0_05</Name>
					<Comment>0.05</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Round1</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Round5</Name>
					<Comment>5</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Round10</Name>
					<Comment>10</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Round50</Name>
					<Comment>50</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Round100</Name>
					<Comment>100</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Round0_1</Name>
					<Comment>0.1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Round0_5</Name>
					<Comment>0.5</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/VATTaxationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>VATTaxationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>TaxableByVAT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotTaxableByVAT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ForExport</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/OperationKindsCustomerOrder.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>OperationKindsCustomerOrder</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>OrderForSale</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OrderForProcessing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JobOrder</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/OperationKindsCustomerInvoice.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>OperationKindsCustomerInvoice</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>SaleToCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferForCommission</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferToProcessing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferForSafeCustody</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnToVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnToPrincipal</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromProcessing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromSafeCustody</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/InventoryTransfer.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>InventoryTransfer</Name>
			<BasedOn>
				<xr:Item>Document.TransferBetweenCells</xr:Item>
				<xr:Item>Document.ProductionOrder</xr:Item>
				<xr:Item>Document.InventoryAssembly</xr:Item>
				<xr:Item>Document.GoodsReceipt</xr:Item>
				<xr:Item>Document.SupplierInvoice</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.RetailAmountAccounting</xr:Item>
				<xr:Item>AccumulationRegister.InventoryFromWarehouses</xr:Item>
				<xr:Item>AccumulationRegister.InventoryForWarehouses</xr:Item>
				<xr:Item>AccumulationRegister.InventoryInWarehouses</xr:Item>
				<xr:Item>AccountingRegister.Managerial</xr:Item>
				<xr:Item>AccumulationRegister.Inventory</xr:Item>
				<xr:Item>AccumulationRegister.InventoryReceived</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpenses</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Vehicle</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Vehicles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ShippingAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CarrierBankAccount</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OperationKindsInventoryTransfer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Driver</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChiefAccountant</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PowerOfAttorneyIssued</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PowerOfAttorneyDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PowerAttorneyPerson</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PowerOfAttorneyNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BasisDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.ProductionOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.InventoryAssembly</v8:Type>
						<v8:Type>cfg:DocumentRef.TransferBetweenCells</v8:Type>
						<v8:Type>cfg:DocumentRef.GoodsReceipt</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CustomerOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BusinessActivity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessActivities</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StampBase</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Released</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReleasedPosition</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Positions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Carrier</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CustomerOrderPosition</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AttributePositionOnForm</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Trailer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Vehicles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Head</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HeadPosition</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Positions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeliveryTerm</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StructuralUnitPayee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GLExpenseAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Cell</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CellPayee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ProductsAndServices</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Batch</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesBatches</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Reserve</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MeasurementUnit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.UOMClassifier</v8:Type>
								<v8:Type>cfg:CatalogRef.UOM</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CustomerOrder</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Cost</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/CommonModules/PickProductsAndServicesInDocumentsClient/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Picking products and services (Client)
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// INTERFACE

////////////////////////////////////////////////////////////////////////////////
// INTERNAL INTERFACE

// Rounds a number according to a specified order.
//
// Parameters:
//  Number        - Number required
//  to be rounded RoundingOrder - Enums.RoundingMethods - round
//  order RoundUpward - Boolean - rounding upward.
//
// Returns:
//  Number        - rounding result.
//
Function RoundPrice(Number, RoundRule, RoundUp) Export
	
	Var Result; // Returned result.
	
	// Transform order of numbers rounding.
	// If null order value is passed, then round to cents. 
	If Not ValueIsFilled(RoundRule) Then
		RoundingOrder = PredefinedValue("Enum.RoundingMethods.Round0_01"); 
	Else
		RoundingOrder = RoundRule;
	EndIf;
	Order = Number(String(RoundingOrder));
	
	// calculate quantity of intervals included in number
	QuantityInterval = Number / Order;
	
	// calculate an integer quantity of intervals.
	NumberOfEntireIntervals = Int(QuantityInterval);
	
	If QuantityInterval = NumberOfEntireIntervals Then
		
		// Numbers are divided integrally. No need to round.
		Result	= Number;
	Else
		If RoundUp Then
			
			// During 0.05 rounding 0.371 must be rounded to 0.4
			Result = Order * (NumberOfEntireIntervals + 1);
		Else
			
			// During 0.05 rounding 0.371 must round to 0.35
			// and 0.376 to 0.4
			Result = Order * Round(QuantityInterval, 0, RoundMode.Round15as20);
		EndIf; 
	EndIf;
	
	Return Result;
	
EndFunction // RoundPrice()


Procedure OpenPick(OwnerForm, TabularSectionName, ChoiceFormFullName) Export
	
	SelectionParameters = New Structure;
	Cancel = False;
	
	FillSelectionParameterValues(OwnerForm, TabularSectionName, ChoiceFormFullName, SelectionParameters);
	
	If Not Cancel Then
		
		NotificationDescriptionOnCloseSelection = New NotifyDescription("OnCloseSelection", PickProductsAndServicesInDocumentsClient.ThisObject);
		OpenForm(ChoiceFormFullName, SelectionParameters, OwnerForm, True, , , NotificationDescriptionOnCloseSelection, FormWindowOpeningMode.LockOwnerWindow);
		
	EndIf;
	
EndProcedure

// Procedure of processing the results of selection closing
//
Procedure OnCloseSelection(ClosingResult, AdditionalParameters) Export
	
	If TypeOf(ClosingResult) = Type("Structure") Then
		
		If Not IsBlankString(ClosingResult.CartAddressInStorage) Then
			
			Notify("SelectionIsMade", ClosingResult.CartAddressInStorage, ClosingResult.OwnerFormUUID);
			
		EndIf;
		
	EndIf;
	
EndProcedure // OnCloseSelection()

// Receive data from owner forms

Procedure FillSelectionParameterValues(OwnerForm, TabularSectionName, ChoiceFormFullName, SelectionParameters)
	
	SelectionParameters.Insert("Company", OwnerForm.ThisObject.Object.Company);
	SelectionParameters.Insert("Date", OwnerForm.ThisObject.Object.Date);
	SelectionParameters.Insert("PricePeriod", OwnerForm.ThisObject.Object.Date);
	SelectionParameters.Insert("OwnerFormUUID", OwnerForm.UUID);
	
	FillDocumentOperationKind(OwnerForm, SelectionParameters);
	FillParameterDocumentCurrency(OwnerForm, SelectionParameters);
	FillParameterStructuralUnit(OwnerForm, SelectionParameters);
	FillDocumentTaxationParameters(OwnerForm, SelectionParameters);
	FillProductsAndServicesTypes(OwnerForm, TabularSectionName, SelectionParameters);
	FillPriceKinds(OwnerForm, ChoiceFormFullName, SelectionParameters);
	FillDiscountKindMarkups(OwnerForm, ChoiceFormFullName, SelectionParameters);
	FillAdditionalParameters(OwnerForm, SelectionParameters);
	// DiscountCards
	FillDiscountCard(OwnerForm, ChoiceFormFullName, SelectionParameters);
	// End DiscountCards
	
EndProcedure

Procedure FillDocumentOperationKind(OwnerForm, SelectionParameters)
	Var OperationKind;
	
	If OwnerForm.Object.Property("OperationKind", OperationKind) Then
		
		SelectionParameters.Insert("OperationKind", OperationKind);
		
	EndIf;
	
EndProcedure

Procedure FillParameterDocumentCurrency(OwnerForm, SelectionParameters)
	
	If OwnerForm.Object.Property("DocumentCurrency") Then
		
		SelectionParameters.Insert("DocumentCurrency", OwnerForm.Object.DocumentCurrency);
		
	Else
		
		SelectionParameters.Insert("DocumentCurrency", Undefined);
		
	EndIf;
	
EndProcedure

Procedure FillParameterStructuralUnit(OwnerForm, SelectionParameters)
	Var StructuralUnit;
	
	If Find(OwnerForm.FormName, "CustomerOrder") > 0 
		OR Find(OwnerForm.FormName, "PurchaseOrder") > 0 Then
		
		OwnerForm.ThisObject.Object.Property("StructuralUnitReserve", StructuralUnit);
		SelectionParameters.Insert("StructuralUnit", StructuralUnit);
		
	ElsIf OwnerForm.FormName = "Document.InventoryTransfer.Form.DocumentForm" Then
		
		OwnerForm.ThisObject.Object.Property("StructuralUnit", StructuralUnit);
		SelectionParameters.Insert("StructuralUnitSender", StructuralUnit);
		
		OwnerForm.ThisObject.Object.Property("StructuralUnitPayee", StructuralUnit);
		SelectionParameters.Insert("StructuralUnitPayee", StructuralUnit);
		
	Else
		
		OwnerForm.ThisObject.Object.Property("StructuralUnit", StructuralUnit);
		SelectionParameters.Insert("StructuralUnit", StructuralUnit);
		
	EndIf;
	
EndProcedure

Procedure FillDocumentTaxationParameters(OwnerForm, SelectionParameters)
	
	If OwnerForm.FormName = "Document.CustomerInvoiceNote.Form.DocumentForm" 
		OR OwnerForm.FormName = "Document.SupplierInvoiceNote.Form.DocumentForm" Then
		
		SelectionParameters.Insert("VATTaxation", PredefinedValue("Enum.VATTaxationTypes.TaxableByVAT"));
		SelectionParameters.Insert("AmountIncludesVAT", False);
		
	ElsIf OwnerForm.FormName = "Document.InventoryTransfer.Form.DocumentForm" Then
		// You do not need to fill attribute for transfer.
		
	Else
		
		SelectionParameters.Insert("VATTaxation", OwnerForm.ThisObject.Object.VATTaxation);
		SelectionParameters.Insert("AmountIncludesVAT", OwnerForm.ThisObject.Object.AmountIncludesVAT);
		
	EndIf;
	
EndProcedure

Procedure FillProductsAndServicesTypes(OwnerForm, TabularSectionName, SelectionParameters)
	
	ProductsAndServicesType = New ValueList;
	
	For Each ArrayElement IN OwnerForm.Items[TabularSectionName + "ProductsAndServices"].ChoiceParameters Do
		
		If ArrayElement.Name = "Filter.ProductsAndServicesType" Then
			
			If TypeOf(ArrayElement.Value) = Type("FixedArray") Then
				
				For Each FixArrayItem IN ArrayElement.Value Do
					
					ProductsAndServicesType.Add(FixArrayItem);
					
				EndDo; 
				
			Else
				
				ProductsAndServicesType.Add(ArrayElement.Value);
				
			EndIf;
			
		EndIf;
		
	EndDo;
	
	SelectionParameters.Insert("ProductsAndServicesType", ProductsAndServicesType);
	
EndProcedure

Procedure FillPriceKinds(OwnerForm, ChoiceFormFullName, SelectionParameters)
	
	If ChoiceFormFullName = "DataProcessor.PickingReceipt.Form.CartPriceBalanceReserveCharacteristic" Then
	// Prices kind for receipt
		
		If OwnerForm.FormName = "Document.SupplierInvoiceNote.Form.DocumentForm" Then
		// Define the prices kinds for entry. documents without an explicit CounterpartyPriceKind attribute
			
			CounterpartyPriceKind = PickProductsAndServicesInDocumentsOverridable.PriceKindCustomerInvoiceNotes(OwnerForm.ThisObject.Object.Counterparty, OwnerForm.ThisObject.Object.Contract, True);
			SelectionParameters.Insert("CounterpartyPriceKind", CounterpartyPriceKind);
			
		Else
			
			SelectionParameters.Insert("CounterpartyPriceKind", OwnerForm.ThisObject.Object.CounterpartyPriceKind);
			
		EndIf;
		
	ElsIf ChoiceFormFullName = "DataProcessor.PickingSales.Form.CartPriceBalanceReserveCharacteristic" Then
	// Prices kind for realization
		
		If OwnerForm.FormName = "Document.CustomerInvoiceNote.Form.DocumentForm" Then
			
			PriceKind = PickProductsAndServicesInDocumentsOverridable.PriceKindCustomerInvoiceNotes(OwnerForm.ThisObject.Object.Counterparty, OwnerForm.ThisObject.Object.Contract, False);
			SelectionParameters.Insert("PriceKind", PriceKind);
			
		Else
			
			SelectionParameters.Insert("PriceKind", OwnerForm.ThisObject.Object.PriceKind);
			
		EndIf;
		
	EndIf;
	
EndProcedure

Procedure FillDiscountKindMarkups(OwnerForm, ChoiceFormFullName, SelectionParameters)
	
	DiscountsMarkupsVisible = False;
	If ChoiceFormFullName = "DataProcessor.PickingSales.Form.CartPriceBalanceReserveCharacteristic" Then
		
		If OwnerForm.ThisObject.Object.Property("DiscountMarkupKind") Then
			
			SelectionParameters.Insert("DiscountMarkupKind", OwnerForm.ThisObject.Object.DiscountMarkupKind);
			DiscountsMarkupsVisible = True;
			
		EndIf;
		
	EndIf;
	
	SelectionParameters.Insert("DiscountsMarkupsVisible", DiscountsMarkupsVisible);
	
EndProcedure

Procedure FillAdditionalParameters(OwnerForm, SelectionParameters)
	
	If OwnerForm.FormName = "Document.ReceiptCR.Form.DocumentForm" OR OwnerForm.FormName = "Document.ReceiptCR.Form.DocumentForm_CWP" Then
		
		SelectionParameters.Insert("IsCRReceipt", True);
		
	EndIf;
	
EndProcedure

#Region DiscountCards

Procedure FillDiscountCard(OwnerForm, ChoiceFormFullName, SelectionParameters)
	
	DiscountCardVisible = False;
	If ChoiceFormFullName = "DataProcessor.PickingSales.Form.CartPriceBalanceReserveCharacteristic" Then
		
		CurrObject = OwnerForm.ThisObject.Object;
		If CurrObject.Property("DiscountCard") Then
			
			DiscountCardVisible = True;
			If TypeOf(CurrObject) = Type("DocumentRef.CustomerOrder") Then
				If CurrObject.OperationKind = PredefinedValue("Enum.OperationKindsCustomerOrder.OrderForProcessing") Then
					DiscountCardVisible = False;
				EndIf;
			ElsIf TypeOf(CurrObject) = Type("DocumentRef.CustomerInvoice") Then
				If CurrObject.OperationKind = PredefinedValue("Enum.OperationKindsCustomerInvoice.SaleToCustomer") Then
					DiscountCardVisible = False;
				EndIf;
			EndIf;
			
			If DiscountCardVisible = True Then
				SelectionParameters.Insert("DiscountCard", OwnerForm.ThisObject.Object.DiscountCard);
				SelectionParameters.Insert("DiscountPercentByDiscountCard", OwnerForm.ThisObject.Object.DiscountPercentByDiscountCard);			
			EndIf;
			
		EndIf;
		
	EndIf;
	
	SelectionParameters.Insert("DiscountCardVisible", DiscountCardVisible);
	
EndProcedure

#EndRegion

// End Get data from forms-owners
